-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3307
-- Время создания: Апр 05 2021 г., 21:21
-- Версия сервера: 10.3.22-MariaDB
-- Версия PHP: 7.4.5

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `russian-friend`
--

-- --------------------------------------------------------

--
-- Структура таблицы `bookstime`
--

CREATE TABLE `bookstime` (
  `id` int(11) NOT NULL,
  `name` varchar(32) NOT NULL,
  `day` varchar(12) NOT NULL,
  `time` varchar(256) NOT NULL,
  `type` varchar(10) NOT NULL,
  `payment` varchar(12) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `bookstime`
--

INSERT INTO `bookstime` (`id`, `name`, `day`, `time`, `type`, `payment`) VALUES
(119, 'User1', '3.04.2021', ' 06:30 - 07:00', 'private', 'payed'),
(123, 'User5', '3.04.2021', ' 07:30 - 08:00', 'free', 'payed'),
(124, 'User5', '3.04.2021', ' 07:00 - 07:30', 'private', 'payed'),
(125, 'User5', '3.04.2021', ' 07:30 - 08:00', 'private', 'payed'),
(126, 'User5', '3.04.2021', ' 08:30 - 09:00', 's-club', 'payed'),
(127, 'User5', '3.04.2021', ' 09:00 - 09:30', 's-club', 'payed'),
(129, 'User2', '4.04.2021', ' 07:00 - 07:30', 'private', 'payed');

-- --------------------------------------------------------

--
-- Структура таблицы `time-intervals`
--

CREATE TABLE `time-intervals` (
  `id` int(11) NOT NULL,
  `day` varchar(12) NOT NULL,
  `time` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `time-intervals`
--

INSERT INTO `time-intervals` (`id`, `day`, `time`) VALUES
(276, '4.08.2022', '06:00 - 06:30, 06:30 - 07:00, 07:00 - 07:30, 07:30 - 08:00, 08:00 - 08:30, 08:30 - 09:00, 09:00 - 09:30'),
(277, '3.08.2022', '13:30 - 14:30, 14:00 - 15:00'),
(301, '4.03.2021', '06:00 - 06:30'),
(302, '3.03.2021', '06:00 - 06:30, 06:30 - 07:00'),
(304, '11.03.2021', '06:00 - 06:30'),
(305, '10.03.2021', '06:00 - 06:30, 06:30 - 07:00'),
(307, '2.03.2021', '06:00 - 06:30, 06:30 - 07:00'),
(316, '9.03.2021', '06:00 - 06:30, 06:30 - 07:00, 07:00 - 07:30, 07:30 - 08:00'),
(321, '2.04.2021', '06:00 - 06:30, 06:30 - 07:00, 07:00 - 07:30, 07:30 - 08:00'),
(329, '23.03.2021', '06:00 - 06:30, 06:30 - 07:00, 07:00 - 07:30, 07:30 - 08:00, 08:00 - 08:30, 08:30 - 09:00, 09:00 - 09:30'),
(330, '24.03.2021', '06:00 - 06:30, 06:30 - 07:00, 07:00 - 07:30, 07:30 - 08:00, 08:00 - 08:30, 08:30 - 09:00, 09:00 - 09:30, 09:30 - 10:00'),
(331, '25.03.2021', '06:00 - 06:30, 06:30 - 07:00, 07:00 - 07:30, 07:30 - 08:00, 08:00 - 08:30, 08:30 - 09:00'),
(332, '27.03.2021', '06:00 - 06:30, 06:30 - 07:00, 07:00 - 07:30, 07:30 - 08:00, 08:00 - 08:30, 08:30 - 09:00, 09:00 - 09:30, 09:30 - 10:00, 10:00 - 10:30, 10:30 - 11:00, 11:00 - 11:30'),
(333, '26.03.2021', '06:00 - 06:30, 06:30 - 07:30, 07:00 - 07:00, 07:30 - 08:00, 08:00 - 08:30, 08:30 - 09:00, 17:30 - 18:30, 19:00 - 20:00'),
(335, '22.03.2021', '06:00 - 06:30, 06:30 - 07:00, 07:00 - 07:30, 07:30 - 08:00, 08:00 - 08:30'),
(336, '28.03.2021', '06:00 - 06:30, 06:30 - 07:00, 07:00 - 07:30, 07:30 - 08:00, 08:00 - 08:30, 13:00 - 14:00'),
(338, '29.03.2021', '08:00 - 09:00, 10:00 - 11:00, 10:30 - 11:30, 11:00 - 12:00, 11:30 - 12:30, 12:00 - 13:00, 12:30 - 13:30'),
(341, '31.03.2021', '08:00 - 09:00, 08:30 - 09:30, 09:00 - 10:00, 09:30 - 10:30, 10:00 - 11:00, 10:30 - 11:30, 11:00 - 12:00, 11:30 - 12:30'),
(342, '30.03.2021', '08:00 - 09:00, 08:30 - 09:30, 09:00 - 10:00, 09:30 - 10:30, 10:00 - 11:00'),
(343, '1.04.2021', '06:00 - 06:30, 06:30 - 07:00, 07:00 - 07:30, 07:30 - 08:00, 08:00 - 08:30, 08:30 - 09:00, 09:00 - 09:30'),
(344, '3.04.2021', '06:00 - 06:30, 06:30 - 07:00, 07:00 - 07:30, 07:30 - 08:00, 08:00 - 08:30, 08:30 - 09:00, 09:00 - 09:30, 09:30 - 10:00'),
(346, '5.04.2021', '06:00 - 06:30, 06:30 - 07:00, 07:00 - 07:30, 07:30 - 08:00, 08:00 - 08:30, 08:30 - 09:00, 09:00 - 09:30, 09:30 - 10:00'),
(347, '6.04.2021', '06:00 - 06:30, 06:30 - 07:00, 07:00 - 07:30, 07:30 - 08:00, 08:00 - 08:30, 08:30 - 09:00, 09:00 - 09:30, 09:30 - 10:00'),
(348, '7.04.2021', '06:00 - 06:30, 06:30 - 07:00, 07:00 - 07:30, 07:30 - 08:00, 08:00 - 08:30'),
(349, '8.04.2021', '06:00 - 06:30, 06:30 - 07:00, 07:00 - 07:30, 07:30 - 08:00, 08:00 - 08:30, 08:30 - 09:00'),
(350, '9.04.2021', '06:00 - 06:30, 06:30 - 07:00, 07:00 - 07:30, 07:30 - 08:00, 08:00 - 08:30, 08:30 - 09:00, 09:00 - 09:30'),
(351, '10.04.2021', '06:00 - 06:30, 06:30 - 07:00, 07:00 - 07:30, 07:30 - 08:00'),
(352, '15.04.2021', '06:00 - 06:30, 06:30 - 07:00, 07:00 - 07:30, 07:30 - 08:00'),
(353, '16.04.2021', '06:00 - 06:30, 06:30 - 07:00, 07:00 - 07:30'),
(354, '14.04.2021', '06:00 - 06:30, 06:30 - 07:00, 07:00 - 07:30, 07:30 - 08:00'),
(355, '21.04.2021', '06:00 - 06:30, 06:30 - 07:00, 07:00 - 07:30, 07:30 - 08:00'),
(356, '29.04.2021', '06:00 - 06:30, 06:30 - 07:00, 07:00 - 07:30, 07:30 - 08:00, 08:00 - 08:30, 08:30 - 09:00'),
(357, '4.04.2021', '06:00 - 06:30, 06:30 - 07:30, 07:30 - 08:00, 08:00 - 08:30, 08:30 - 09:00, 09:00 - 09:30, 09:30 - 10:00');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `name` varchar(64) NOT NULL,
  `password` varchar(64) NOT NULL,
  `email` varchar(64) NOT NULL,
  `skype` varchar(64) NOT NULL,
  `register` date NOT NULL,
  `status` varchar(8) NOT NULL,
  `avatar` varchar(128) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `name`, `password`, `email`, `skype`, `register`, `status`, `avatar`) VALUES
(44, 'Николай', '466d588e92d61003dfcf4c1922c6a488', 'mr.coul@inbox.ru', '', '0000-00-00', 'admin', ''),
(45, 'Светлана', '1507a5bd580d9b34def09677deb2da0b', 'svetlanatotr@inbox.ru', ' ', '0000-00-00', 'admin', ''),
(53, 'User1', 'd9a6f01b8f6cf1746e8a55a21cdcd8b3', 'user1@mail.ru', 'user1Skype', '0000-00-00', 'blocked', ''),
(54, 'User2', '0010a38b5261aacf88210dadd31b4d6e', 'user2@mail.ru', 'user2', '0000-00-00', 'active', ''),
(55, 'User3', 'b19ba10ceff95fa68e0fa733dcb1cd76', 'user3@mail.ru', 'user3Skype', '0000-00-00', 'new', ''),
(56, 'User4', '11b60668c36c9555103a9a27d6d6d1fe', 'user4@mail.ru', 'user4', '0000-00-00', 'new', ''),
(57, 'User5', '325c157a8b18499f5969aec11f505d2a', 'user5@mail.ru', 'user5', '0000-00-00', 'active', ''),
(60, 'user6', '656e3bf368d83524bd14da9a1db7bc70', 'user6@mail.ru', ' ', '2021-04-04', 'active', ''),
(61, 'user7', '064c8247bd68155d7e4ea3f8b198e15b', 'user7@mail.ru', ' ', '2021-04-05', 'new', '/images/user-avatars/60_min.png');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `bookstime`
--
ALTER TABLE `bookstime`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `time-intervals`
--
ALTER TABLE `time-intervals`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `bookstime`
--
ALTER TABLE `bookstime`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=131;

--
-- AUTO_INCREMENT для таблицы `time-intervals`
--
ALTER TABLE `time-intervals`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=358;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=62;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
